Tekla Open API Reference for Tekla Structures 2025
ImageListComboBox Properties
The ImageListComboBox type exposes the following members.
Properties
Name | Description
DefaultValue
 Gets or sets the default value in the image combo box. If the value is not found, SelectedItem is used instead.
HoverColor
 Gets or sets the hover color of the combo box.
ImageList
 Gets or sets the ImageList that contains the images to be displayed in the combo box. Recommended image file formats are JPG and BMP.
SelectedIndex
 Gets or sets the selected index of the image in the image combo box.
SelectedItem
 Gets or sets the selected image in the image combo box. If the image is not found, SelectedIndex is used instead.
ToolTipText
 Gets or sets the tool tip text.
Top
See Also
Reference
ImageListComboBox Class
Tekla.Structures.Dialog.UIControls Namespace